robkaram/opennfm/trunk/sys/lpc313x/lib/lpc313x_cgu_driver.c
   }
   else 	if (clkid == CGU_UART_LAST)
   {
      *pDomainId = CGU_SB_UART_BASE_ID;
      fracdiv_base = CGU_SB_BASE6_FDIV_LOW_ID;

   }
   else 	if (clkid <= CGU_CLK1024FS_LAST)
   {
      *pDomainId = CGU_SB_CLK1024FS_BASE_ID;
      fracdiv_base = CGU_SB_BASE7_FDIV_LOW_ID;

   }
   else 	if (clkid == CGU_I2SRX_BCK0_LAST)
   {
      *pDomainId = CGU_SB_I2SRX_BCK0_BASE_ID;
      fracdiv_base = CGU_INVALID_ID;

   }
   else 	if (clkid == CGU_I2SRX_BCK1_LAST)
   {
      *pDomainId = CGU_SB_I2SRX_BCK1_BASE_ID;
      fracdiv_base = CGU_INVALID_ID;

   }
   else 	if (clkid <= CGU_SPI_LAST)
   {
      *pDomainId = CGU_SB_SPI_CLK_BASE_ID;
      fracdiv_base = CGU_SB_BASE10_FDIV_LOW_ID;

   }
   else
   {
      *pDomainId = CGU_SB_SYSCLK_O_BASE_ID;
      fracdiv_base = CGU_INVALID_ID;
   }

   *pSubdomainId = CGU_INVALID_ID;

   /* read the clocks ESR to get the fractional divider */
   esrIndex = cgu_clkid2esrid(clkid);

   if (CGU_INVALID_ID != esrIndex)
   {
      /* read the clocks ESR to get the fractional divider */
      esrReg = CGU_SB->clk_esr[esrIndex];

      /* A clock may not be connected to any sub-domain and it might be
      connected directly to domain. This is also a valid combination. So,
      errror should not be returned */
      if (esrReg & CGU_SB_ESR_ENABLE)
      {
         *pSubdomainId = CGU_SB_ESR_SEL_GET(esrReg) + fracdiv_base;
      }
   }

}

/***********************************************************************
*
* Function: cgu_fdiv_config
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
/* frac divider config function */
UNS_32 cgu_fdiv_config(UNS_32 fdId,
                       CGU_FDIV_SETUP_T fdivCfg,
                       BOOL_32 enable,
                       BOOL_32 dyn_fdc)
{
   UNS_32 conf, maddw, msubw, maxw, fdWidth;
   INT_32 madd, msub;

   /* calculating program values to see if they fit in fractional divider*/
   madd = fdivCfg.m - fdivCfg.n;
   msub = -fdivCfg.n;

   /* Find required bit width of madd & msub:*/
   maddw = cgu_fdiv_num_bits((UNS_32)madd);
   msubw = cgu_fdiv_num_bits((UNS_32)fdivCfg.n);
   maxw = (maddw > msubw) ? maddw : msubw;
   fdWidth = CGU_SB_BASE0_FDIV0_W;

   if (fdId == CGU_SB_BASE7_FDIV_LOW_ID)
   {
      /* for Frac divider 17 the bit width is 13 */
      fdWidth = CGU_SB_BASE7_FDIV0_W;
   }

   /* Calculate Configure parameter:*/
   conf = ((((1 << fdWidth) - 1) &
            (msub << (fdWidth - maxw))) <<
           (fdWidth + CGU_SB_FDC_MADD_POS)) |
          (madd << (fdWidth - maxw + CGU_SB_FDC_MADD_POS));

   /* check whther 50% duty cycle is needed for this divider*/
   if (fdivCfg.stretch)
      conf |= CGU_SB_FDC_STRETCH;
   /* check whehter to enable the divider immediately */
   if (enable)
      conf |= CGU_SB_FDC_RUN;

   /* finally configure the divider*/
   if (FALSE == dyn_fdc)
   {
      CGU_SB->base_fdc[fdId] = conf;
   }
   else
   {
      if (fdId < CGU_SB_NR_DYN_FDIV)
         CGU_SB->base_dyn_fdc[fdId] = conf | CGU_SB_DYN_FDC_ALLOW;
   }

   return conf;
}
/***********************************************************************
*
* Function: cgu_init_domain_clks
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
void cgu_init_domain_clks(CGU_DOMAIN_CFG_T* pDomain)
{
   UNS_32 fd_id, clk_id, esr_id;
   CGU_SUB_DOMAIN_CFG_T* psub = pDomain->sub;
   UNS_32 bcr_id = cgu_DomainId2bcrid(pDomain->id);
   UNS_32 fdiv_conf = 0;

   if (bcr_id != CGU_INVALID_ID)
   {
      /* disable BCR for domain */
      CGU_SB->base_bcr[bcr_id] = 0;
   }

   /* configure frac divider */
   for (fd_id = 0; fd_id < pDomain->fdiv_cnt; fd_id++, psub++)
   {
      /* set fractional dividers but don't enable them yet*/
      fdiv_conf = cgu_fdiv_config(fd_id + pDomain->fdiv_min, psub->fdiv_cfg, FALSE, FALSE);

      /* enable frac divider only if it has valid settings. Or else it may be unused*/
      if (fdiv_conf != 0)
      {
         /* select frac div for each clock in this sub domain*/
         for (clk_id = 0; clk_id <= pDomain->clk_cnt; clk_id++)
         {
            esr_id = cgu_clkid2esrid((CGU_CLOCK_ID_T)(clk_id + pDomain->clk_min));
            if (esr_id != CGU_INVALID_ID)
            {
               /* check whether clock belongs to this sub-domain */
               if (psub->clks & _BIT(clk_id))
               {
                  /* finally configure the clock*/
                  CGU_SB->clk_esr[esr_id] = CGU_SB_ESR_SELECT(fd_id) | CGU_SB_ESR_ENABLE;
               }
            }
         }
         /* enable frac divider */
         CGU_SB->base_fdc[fd_id + pDomain->fdiv_min] |= CGU_SB_FDC_RUN;
      }
   }
   if (bcr_id != CGU_INVALID_ID)
   {
      /* enable BCR for domain */
      CGU_SB->base_bcr[bcr_id] = CGU_SB_BCR_FD_RUN;
   }
   /* select input for domain*/
   cgu_set_base_freq(pDomain->id, pDomain->fin_sel);
}


/***********************************************************************
* CGU driver public functions
***********************************************************************/
/***********************************************************************
*
* Function: cgu_init
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
void cgu_init(UNS_32 clkin_freq[CGU_FIN_SELECT_MAX])
{
   UNS_32 i = CGU_FIN_SELECT_MAX;

   /* initialize the CGU Driver data */
   while (i--)
   {
      g_cgu_driver.clkin_freq[i] = clkin_freq[i];
   }

   /* set init  done */
   g_cgu_driver.init = TRUE;

