robkaram/opennfm/trunk/sys/lpc313x/lib/lpc313x_cgu_driver.c
   /**********************************************************/
   /* initiliase Domain5 = PCM_BASE clocks */
   /**********************************************************/
   domain.id = CGU_SB_PCM_BASE_ID;
   domain.fin_sel = pClksCfg->domain5.fin_sel;
   domain.clk_min = CGU_PCM_FIRST;
   domain.clk_cnt = 1;
   domain.fdiv_min = CGU_SB_BASE5_FDIV_LOW_ID;
   domain.fdiv_cnt = CGU_SB_BASE5_FDIV_CNT;
   domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain5.sub[0];
   /* initialize all clocks and frac dividers for this domain */
   cgu_init_domain_clks(&domain);

   /**********************************************************/
   /* initiliase Domain6 = UART_BASE clocks */
   /**********************************************************/
   domain.id = CGU_SB_UART_BASE_ID;
   domain.fin_sel = pClksCfg->domain6.fin_sel;
   domain.clk_min = CGU_UART_FIRST;
   domain.clk_cnt = 1;
   domain.fdiv_min = CGU_SB_BASE6_FDIV_LOW_ID;
   domain.fdiv_cnt = CGU_SB_BASE6_FDIV_CNT;
   domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain6.sub[0];
   /* initialize all clocks and frac dividers for this domain */
   cgu_init_domain_clks(&domain);

   /**********************************************************/
   /* initiliase Domain7 = CLK1024FS_BASE clocks */
   /**********************************************************/
   domain.id = CGU_SB_CLK1024FS_BASE_ID;
   domain.fin_sel = pClksCfg->domain7.fin_sel;
   domain.clk_min = CGU_CLK1024FS_FIRST;
   domain.clk_cnt = (CGU_CLK1024FS_LAST - CGU_CLK1024FS_FIRST) + 1;
   domain.fdiv_min = CGU_SB_BASE7_FDIV_LOW_ID;
   domain.fdiv_cnt = CGU_SB_BASE7_FDIV_CNT;
   domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain7.sub[0];
   /* initialize all clocks and frac dividers for this domain */
   cgu_init_domain_clks(&domain);

   /**********************************************************/
   /* initiliase Domain8 = I2SRX_BCK0_BASE clocks */
   /**********************************************************/
   /* select input for domain*/
   cgu_set_base_freq(CGU_SB_I2SRX_BCK0_BASE_ID, pClksCfg->domain8.fin_sel);

   /**********************************************************/
   /* initiliase Domain9 = I2SRX_BCK1_BASE clocks */
   /**********************************************************/
   /* select input for domain*/
   cgu_set_base_freq(CGU_SB_I2SRX_BCK1_BASE_ID, pClksCfg->domain9.fin_sel);

   /**********************************************************/
   /* initiliase Domain10 = SPI_BASE clocks */
   /**********************************************************/
   domain.id = CGU_SB_SPI_CLK_BASE_ID;
   domain.fin_sel = pClksCfg->domain10.fin_sel;
   domain.clk_min = CGU_SPI_FIRST;
   domain.clk_cnt = (CGU_SPI_LAST - CGU_SPI_FIRST) + 1;
   domain.fdiv_min = CGU_SB_BASE10_FDIV_LOW_ID;
   domain.fdiv_cnt = CGU_SB_BASE10_FDIV_CNT;
   domain.sub = (CGU_SUB_DOMAIN_CFG_T*) & pClksCfg->domain10.sub[0];
   /* initialize all clocks and frac dividers for this domain */
   cgu_init_domain_clks(&domain);

   /**********************************************************/
   /* initiliase Domain11 = SYSCLK_O_BASE clocks */
   /**********************************************************/
   /* select input for domain*/
   cgu_set_base_freq(CGU_SB_SYSCLK_O_BASE_ID, pClksCfg->domain11.fin_sel);

   /**********************************************************/
   /* initiliase Dynamic fractional dividers TBD */
   /**********************************************************/
#if 0
   /* disable BCR for domain */
   CGU_SB->base_bcr[0] = 0;
   for (i = 0; i < CGU_SB_NR_DYN_FDIV; i++)
   {
      if (pClksCfg->dyn_fdiv_cfg[i].cfg.n != 0)
      {
         CGU_SB->base_dyn_sel[i] = pClksCfg->dyn_fdiv_cfg[i].sel;
         cgu_fdiv_config(i, pClksCfg->dyn_fdiv_cfg[i].cfg, TRUE, TRUE);
      }
      else
      {
         CGU_SB->base_dyn_fdc[i] = 0;
      }

   }

   CGU_SB->base_bcr[0] = CGU_SB_BCR_FD_RUN;
#endif


   return _NO_ERROR;
}

/***********************************************************************
*
* Function: cgu_get_base_freq
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
INT_32 cgu_get_base_freq(CGU_DOMAIN_ID_T baseid)
{
   INT_32 freq;

   /* check whether driver is initialized */
   if (g_cgu_driver.init == FALSE)
   {
      return _ERROR;
   }

   /* get base frequency for the domain */
   freq = g_cgu_driver.clkin_freq[CGU_SB_SSR_FS_GET(CGU_SB->base_ssr[baseid])];

   return freq;
}

/***********************************************************************
*
* Function: cgu_set_base_freq
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
void cgu_set_base_freq(CGU_DOMAIN_ID_T baseid, UNS_32 fin_sel)
{
   UNS_32 baseSCR;

   /* Switch configuration register*/
   baseSCR = CGU_SB->base_scr[baseid] & ~CGU_SB_SCR_FS_MASK;
   /* If fs1 is currently enabled set refId to fs2 and enable fs2*/
   if (CGU_SB->base_ssr[baseid] & CGU_SB_SCR_EN1)
   {
      /* check if the selcted frequency is same as requested. If not switch.*/
      if (CGU_SB->base_fs1[baseid] != fin_sel)
      {
         CGU_SB->base_fs2[baseid] = fin_sel;

         /* Don't touch stop bit in SCR register*/
         CGU_SB->base_scr[baseid] = baseSCR | CGU_SB_SCR_EN2;
      }
   }
   else
   {
      /* check if the selcted frequency is same as requested. If not switch.*/
      if (CGU_SB->base_fs2[baseid] != fin_sel)
      {
         CGU_SB->base_fs1[baseid] = fin_sel;

         /* Don't touch stop bit in SCR register*/
         CGU_SB->base_scr[baseid] = baseSCR | CGU_SB_SCR_EN1;
      }
   }
}

/***********************************************************************
*
* Function: cgu_get_clk_freq
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
UNS_32 cgu_get_clk_freq(CGU_CLOCK_ID_T clkid)
{
   UNS_32 freq = 0;
   CGU_DOMAIN_ID_T domainId;
   UNS_32 subDomainId;
   INT_32 n, m;
   UNS_32 fdcVal;

   /* check whether driver is initialized */
   if (g_cgu_driver.init == FALSE)
   {
      return 0;
   }

