robkaram/opennfm/trunk/sys/lpc313x/lib/lpc313x_cgu_driver.c
   /* All the reset registers are continously mapped with an address difference of 4 */
   pmod_rst_reg += modId;

   /* clear and set the register */
   *pmod_rst_reg = 0;
   /* introduce some delay */
   for (i = 0; i < 1000; i++);

   *pmod_rst_reg = CGU_CONFIG_SOFT_RESET;
}

/***********************************************************************
*
* Function: cgu_clk_set_exten
*
* Purpose:
*
* Processing:
*     .
*
* Parameters:
*     i : Number
*
* Outputs: None
*
* Returns:
*
* Notes: None
*
**********************************************************************/
void cgu_clk_set_exten(CGU_CLOCK_ID_T clkid, BOOL_32 enable)
{
   switch (clkid)
   {
      case CGU_SB_OTP_PCLK_ID:
      case CGU_SB_PCM_APB_PCLK_ID:
      case CGU_SB_EVENT_ROUTER_PCLK_ID:
      case CGU_SB_ADC_PCLK_ID:
      case CGU_SB_IOCONF_PCLK_ID:
      case CGU_SB_CGU_PCLK_ID:
      case CGU_SB_SYSCREG_PCLK_ID:
      case CGU_SB_DMA_CLK_GATED_ID:
      case CGU_SB_SPI_PCLK_GATED_ID:
      case CGU_SB_SPI_CLK_GATED_ID:
      case CGU_SB_PCM_CLK_IP_ID:
      case CGU_SB_PWM_PCLK_REGS_ID:
         if (enable)
         {
            CGU_SB->clk_pcr[clkid] |= CGU_SB_PCR_EXTEN_EN;
         }
         else
         {
            CGU_SB->clk_pcr[clkid] &= ~CGU_SB_PCR_EXTEN_EN;
         }
         break;
         /* force disable for the following clocks */
      case CGU_SB_I2C0_PCLK_ID:
      case CGU_SB_I2C1_PCLK_ID:
      case CGU_SB_WDOG_PCLK_ID:
      case CGU_SB_UART_APB_CLK_ID:
      case CGU_SB_LCD_PCLK_ID:
         CGU_SB->clk_pcr[clkid] &= ~CGU_SB_PCR_EXTEN_EN;
         break;
      default:
         break;
   }
}

